In [1]:
import pandas as pd
import os

In [2]:
student_data = os.path.join('..','Resources','new_full_student_data.csv')
student_df = pd.read_csv(student_data)

In [3]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [4]:
# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
# Drop null values
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
# Check for duplicate rows
student_df.duplicated().sum()

1836

In [7]:
# Drop duplicate rows
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [8]:
# Check the type of the grade column with dtypes
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [9]:
# View the grade column to look for a reason it isn't numeric
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [10]:
# Remove 'th' suffixes by replacing with and empty string
student_df['grade'] = student_df['grade'].str.replace('th', '')

In [11]:
# View the grade column to ensure the suffixes were removed
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [12]:
# Convert the data type of the "grade" column to a `int`
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [13]:
# Use the head (and/or the tail) function to preview the DataFrame.
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

In [14]:
# generate summary statistics with describe.
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [15]:
# mean math score
mean_math = student_df["math_score"].mean()
mean_math

64.67573326141189

In [16]:
# min reading score
min_reading_score =  student_df["reading_score"].min()
min_reading_score

10.5

In [17]:
#using location to find a column called grade 
grade = student_df.loc[:, "grade"]
grade

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [18]:
# Display the first three rows of Columns 3, 4, and 5 by using iloc, as the following image shows:

student_df.loc[0:2,["school_name", "reading_score", "math_score"]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [19]:
# Select the rows for Grade 9, and display their summary statistics by using loc and describe, as the following image shows:

student_df.loc[:,["student_id","grade", "reading_score","math_score","school_budget"]].describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [20]:
# Store the row with the minimum overall reading score in min_reading_row by using loc and the min_reading_score variable from Deliverable 3, as the following image shows:

student_df.loc[(student_df["reading_score"]==10.5)]

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [21]:
# Select all the reading scores from the 10th graders at Dixon High Schoo

reading_scores = student_df.loc[
    (student_df["grade"] == 10) & 
    (student_df["school_name"] == "Dixon High School"), 
        ["school_name",
         "grade",
        "reading_score"]]
reading_scores

             school_name  grade  reading_score
45     Dixon High School     10           71.1
60     Dixon High School     10           59.5
69     Dixon High School     10           88.6
94     Dixon High School     10           81.5
100    Dixon High School     10           95.3
...                  ...    ...            ...
19283  Dixon High School     10           52.9
19306  Dixon High School     10           58.0
19344  Dixon High School     10           38.0
19368  Dixon High School     10           84.4
19445  Dixon High School     10           43.9

[569 rows x 3 columns]

In [22]:
# Find the mean reading score for all the students in Grades 11 and 12 combined

student_df.loc[(student_df["grade"]== 11)|(student_df["grade"]==12),"reading_score"].mean()

74.90038089192188

In [23]:
# Display the average budget for each school type

average_school_budget = student_df.groupby(by = "school_type").mean()
average_school_budget.loc[:,["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [24]:
# Group by school, then grade before calculating the average scores
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319

In [ ]:
# After importing and cleaning our data by dropping null values and duplicate rows, 
# we begin to analyze it by using mean and min functions of the pandas library.
# We are able to isolate or group specific columns and ask to return specific calculations.